Repository: abdo2121nasser/portable_gym
Catalog: portable_gym/lib/l10n/intl_*.arb
Languages: ar

source: Login
ar: تسجيل الدخول

source: Welcome
ar: اهلا

# logOutMassage
source: Are you sure you want to log out ?
ar: هل تريد حقا تسجيل الخروج ؟

source: Email
ar: البريد الاليكتروني

source: Password
ar: كلمه السر

source: Forget Password
ar: هل نسيت كلمه السر

# loginOtherOptions
source: or sign up with
ar: او سجل عن طريق

# loginSignUpOption
source: Don’t have an account?
ar: ليس لديك حساب ؟

source: SignUp
ar: انشئ حساب

source: Create Account
ar: انشئ حساب

source: Let's start!
ar: يلا نبدأ

source: Full name
ar: الاسم كامل

source: Confirm Password
ar: تأكيد كلمه المرور

source: Already have an account?
ar: هل لديك حساب ؟

source: Forgotten Password
ar: نيسيت كلمه السر

# enterYourEmail
source: Enter Your Email Address
ar: ادخل بريدك الاليكتروني

source: Reset Password
ar: غير كلمه السر

source: Back
ar: رجوع

source: What’s Your Gender
ar: ما هو جنسك

# continued
source: Continue
ar: استمر

source: How Old Are You?
ar: ما هو عمرك؟

# whatsYourWeight
source: What Is Your Weight?
ar: ما هو وزنك ؟

# whatsYourHeight
source: What Is Your Height?
ar: ما هو طولك?

# enterYourWeight
source: Enter Your Weight in KG
ar: ادخل وزنك ب KG

# enterYourHeight
source: Enter Your Height in CM
ar: ادخل طولك ب CM

# whatsYourGoal
source: What Is Your Goal?
ar: ما هو هدفك؟

source: Weight Loss
ar: خساره وزن

source: Weight Gain
ar: زياده وزن

source: Muscles Mass Gain
ar: كسب عضلاط

source: Shape body
ar: تجسيم

source: Other
ar: اخري

source: Physical Activity Level
ar: مستوي التدريب البدني

source: Fill Your Profile
ar: املاء صفحتك الشخصيه

source: years old
ar: عاما

source: Start
ar: أبدء

source: the email field is empty!!
ar: مجال البريد الاليكتروني فارغ!!

source: email field pattern is wrong
ar: نمط البريد الاليكتروني خاطئ

source: the password field is empty!!
ar: خانه كلمه السر فارغه

source: password should be at least 8 numbers or characters
ar: كلمه السر يجب ان تحتوي علي الاقل علي 8 احرف

source: the full name field is empty!!
ar: مكان الاسم الكامل فارغ!!

source: the nick name field is empty!!
ar: مكان الاسم الحركي فارغ!!

# nameFieldShouldNotContainNumbers
source: full name field should not contain numbers
ar: يجب علي الاسم الكامل الا يحتوي علي ارقام

source: confirm password is not equal to password!!
ar: كلمه المرور لا تطابق تأكيد كلمه المور!!

source: you should choose profile photo
ar: يجب ان تختار صوره لملفك الشخصي

source: Something Went Wrong
ar: حدث خطأ ما

source: Success
ar: تم بنجاح

source: Nickname
ar: اللقب

source: Phone
ar: رقم الهاتف

source: Age
ar: العمر

# subTitle
source: It's time to challenge your limits.
ar: انه الوقت لتتحدي حدودك

source: My Profile
ar: الملف الشخصي

source: Settings
ar: الاعدادات

source: Logout
ar: تسجيل الخروج

# birthDate
source: Date of birth
ar: تاريخ الميلاد

source: Weight
ar: الوزن

source: Height
ar: الطول

source: Workout
ar: العمل

# progressTrack
source: Progress tracking
ar: تتبع العمل

source: Nutrition
ar: التغذيه

source: see all
ar: المذيد

source: Recommendations
ar: المقترحات

source: Weekly Challenge
ar: تحدي الاسبوع

source: Beginner
ar: مبدء

source: Intermediate
ar: متوسط

source: Advanced
ar: متقدم

# trainingOfDay
source: training of the day
ar: تمرين اليوم

source: Round
ar: جوله

# reputation
source: repetition
ar: التكرار

# reputationShort
source: Rep
ar: عدد

# hour
source: H
ar: ث

# minute
source: M
ar: د

# second
source: S
ar: س

# englishWord
source: English
ar: اجليش

# arabicWord
source: Arabic
ar: عربي

source: Training Time
ar: وقت التدريب

source: PickVideo
ar: اختر فيديو

source: Upload Training
ar: تحميل التمرين

source: Upload body category
ar: تحميل تصنيف التمرين

source: edit body category
ar: تعديل تصنيف التمرين

source: add body category
ar: اضف تصنيف التمرين

source: add new training
ar: اضف تمرين جديد

source: edit training
ar: تعديل تمرين

# minuteWord
source: minute
ar: دقيقه

source: KCal
ar: سعرات

source: exercises
ar: تمارين

source: Let's go
ar: لنبدء

source: Explore Different Workout Styles
ar: استكشف العديد من اساليب التمرين

source: meal plan
ar: خطط للوجبات

source: meal idea
ar: افكار للوجبات

# recipeOfDay
source: recipe of the day
ar: وصفه اليوم

source: BreakFast
ar: الفطار

source: Lunch
ar: الغداء

source: Dinner
ar: العشاء

source: Snacks
ar: وجبه خفيفه

source: Recipe
ar: وصفه

source: Add Recipe
ar: اضف وصفه

source: Edit Recipe
ar: عدل الوصفه

source: protein
ar: بروتين

source: carbohydrate
ar: كاربوهايدريت

source: Advantage
ar: المميزات

source: food main element
ar: العناصر الاساسيه في الطعام

source: Add
ar: اضف

source: Edit
ar: عدل

source: Cancel
ar: الغاء

source: Workout Log
ar: سجل التمارين

source: Charts
ar: المخططات

source: Choose Date
ar: اختر تاريخ

source: Activities
ar: النشاط
